export const introContents = [
  {
    question: "프론트엔드 개발자로 전향한 이유",
    answer:
      "IT기업의 운영/사업팀에서 근무하며, 저는 사용자 경험을 개선하기 위해 고객의 피드백을 분석하고, 이를 기반으로 기능을 최적화하는 업무를 담당했습니다. 사용자가 기능을 찾기 어려워하는 문제를 발견하고, 사용자들의 업무 흐름을 고려하여 이를 간소화한 경험은 저에게 큰 의미가 있었습니다. 이 경험을 통해 직접적으로 사용자 경험에 기여하는 개발자의 역할에 매력을 느꼈고, 프론트엔드 개발자로 전향하기로 결심했습니다. 이후, 엘리스 SW 엔지니어 트랙과 42Seoul을 수료하며 개발자로서의 기반을 다졌습니다.",
    highlights: [
      "사용자 경험을 개선하기 위해 고객의 피드백을 분석하고, 이를 기반으로 기능을 최적화하는 업무",
      "사용자들의 업무 흐름을 고려하여 이를 간소화한 경험",
      "직접적으로 사용자 경험에 기여하는 개발자의 역할",
      "엘리스 SW 엔지니어 트랙과 42Seoul을 수료하며 개발자로서의 기반을 다졌습니다.",
    ],
  },
  {
    question: "협력과 소통을 통해 성과를 이룬 경험",
    answer:
      "42Seoul에서의 학습 경험을 통해 저는 소통과 협력의 중요성을 체감했습니다. 교수나 교재 없이 동료들과 지식을 공유하고, 코드 리뷰를 통해 서로 성장하는 환경에서, 다양한 의견을 조율하며 더 나은 결과를 도출해냈습니다. 이전 IT 기업에서 개발팀과 협력하여 프로젝트를 성공적으로 완료한 경험 역시, 협력과 소통이 프로젝트의 성패를 좌우한다는 것을 깨닫게 해주었습니다. 이러한 경험들은 저를 더욱 소통과 협업에 강한 개발자로 성장하게 했습니다.",
    highlights: [
      "소통과 협력의 중요성",
      "동료들과 지식을 공유하고, 코드 리뷰를 통해 서로 성장하는 환경",
      "다양한 의견을 조율하며 더 나은 결과를 도출",
      "개발팀과 협력하여 프로젝트를 성공적으로 완료한 경험",
      "소통과 협업에 강한 개발자로 성장",
    ],
  },
  {
    question: "프론트엔드 개발자로서 역량을 강화하기 위한 노력",
    answer:
      "프론트엔드 개발자로서의 역량을 강화하기 위해 저는 다양한 프로젝트를 수행하며 실력을 쌓아왔습니다. 20여 개의 프로그래밍 과제와 4개의 웹 개발 프로젝트를 통해 실무 능력을 키웠고, 현재는 JavaScript와 TypeScript의 심도 있는 이론을 학습하며 코드의 안정성과 유지보수성을 높이고 있습니다. 이러한 지속적인 학습과 실전 경험을 통해, 사용자 중심의 서비스를 제공하는 프론트엔드 개발자로서의 역량을 적극적으로 키워가고 있습니다.",
    highlights: [
      "다양한 프로젝트를 수행하며 실력을 쌓아왔습니다.",
      "지속적인 학습과 실전 경험을 통해, 사용자 중심의 서비스를 제공하는 프론트엔드 개발자로서의 역량을 적극적으로 키워가고 있습니다.",
    ],
  },
];
